bouffalolab/bl_iot_sdk/components/platform/soc/bl702/bl702_std/BSP_Driver/LHalDriver/Src/lhal_bl702_uart.c
/**
 * *****************************************************************************
 * @file lhal_bl702_uart.c
 * @version 0.1
 * @date 2020-06-03
 * @brief 
 * *****************************************************************************
 * @attention
 * 
 *  <h2><center>&copy; COPYRIGHT(c) 2020 Bouffalo Lab</center></h2>
 * 
 *  Redistribution and use in source and binary forms, with or without modification,
 *  are permitted provided that the following conditions are met:
 *    1. Redistributions of source code must retain the above copyright notice,
 *       this list of conditions and the following disclaimer.
 *    2. Redistributions in binary form must reproduce the above copyright notice,
 *       this list of conditions and the following disclaimer in the documentation
 *       and/or other materials provided with the distribution.
 *    3. Neither the name of Bouffalo Lab nor the names of its contributors
 *       may be used to endorse or promote products derived from this software
 *       without specific prior written permission.
 * 
 *  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 *  AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 *  IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 *  DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
 *  FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 *  DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 *  SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
 *  CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
 *  OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
 *  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 * 
 * *****************************************************************************
 */

/*
 * This file is Lhal driver , which provide glue between HAL and StdDriver.
 * HAL implement standard peripheral API , and This file will reailze HAL 
 * implement use stddriver.
 */

#include "hal_uart.h"
#include "lhal_bl702_uart.h"
#include "bl702_uart.h"
#include "bl702_hbn.h"
#include "bl702_gpio.h"
#include "bl702_glb.h"
#include "bl702.h"
#include "bl702_common.h"
#include "uart_reg.h"
#include "bl702_dma.h"


void         UARTBLXXX_close(UART_Handle handle);
int_fast16_t UARTBLXXX_control(UART_Handle handle, uint_fast16_t cmd,void *arg);
void         UARTBLXXX_init(UART_Handle handle);
UART_Handle  UARTBLXXX_open(UART_Handle handle, UART_Params *params);
int_fast32_t UARTBLXXX_read(UART_Handle handle, void *buffer, size_t size);
uint_fast16_t UARTBLXXX_rxFifoDump(UART_Handle handle,uint8_t * buf);
void         UARTBLXXX_readCancel(UART_Handle handle);
int_fast32_t UARTBLXXX_write(UART_Handle handle, const void *buffer,size_t size);
void         UARTBLXXX_writeCancel(UART_Handle handle);
uint_fast32_t UARTBLXXX_getDMAAddr(UART_Handle handle);
uint_fast8_t UARTBLXXX_getRxReq(UART_Handle handle);
uint_fast8_t UARTBLXXX_getTxReq(UART_Handle handle);

static void  UARTBLXXX_initHw(UART_Handle handle);
static bool  UARTBLXXX_initIO(UART_Handle handle);


static void UARTBLXXX_UART0_RX_Cbf(void);
static void UARTBLXXX_UART1_RX_Cbf(void);
static void UARTBLXXX_UART0_TX_Cbf(void);
static void UARTBLXXX_UART1_TX_Cbf(void);
static void UARTBLXXX_ERROR_Cbf(void);

static intCallback_Type * rx_func_list[]={
    UARTBLXXX_UART0_RX_Cbf,
    UARTBLXXX_UART1_RX_Cbf,
};

static intCallback_Type * tx_func_list[]={
    UARTBLXXX_UART0_TX_Cbf,
    UARTBLXXX_UART1_TX_Cbf,
};

UART_Handle uart_handle_temp[UARTBLXXX_MAX_UART_NUM];
BL_Sts_Type uart_device_open_status[UARTBLXXX_MAX_UART_NUM];
Ring_Buffer_Type      uart_rx_ringBuffer; 
static IRQn_Type uartIrqn_list[] = {
    UART0_IRQn,
    UART1_IRQn,
};

static const uint32_t uart_dma_addr_list[2]={
    0x4000A088,
    0x4000A08c,
};

/* UART function table for UARTBLXXX implementation */
const UART_FxnTable UARTBLXXX_fxnTable = {
    UARTBLXXX_close,
    UARTBLXXX_control,
    UARTBLXXX_init,
    UARTBLXXX_open,
    UARTBLXXX_read,
    UARTBLXXX_rxFifoDump,
    UARTBLXXX_readCancel,
    UARTBLXXX_write,
    UARTBLXXX_writeCancel,
    UARTBLXXX_getDMAAddr,
    UARTBLXXX_getRxReq,
    UARTBLXXX_getTxReq,
};


/*!
 *  @brief UART BLXXX initialization
 *
 *  @pre    Calling context: Hwi, Swi, Task, Main
 *
 *  @param handle  A UART_Handle
 *
 */
void UARTBLXXX_init(UART_Handle handle)
{
    UARTBLXXX_Object           *object;

    /* Get the pointer to the object */
    object = handle->object;
    object->opened = false;
}

/*!
 *  @brief  Function to initialize the BLXXX UART peripheral specified by the
 *          particular handle. The parameter specifies which mode the UART
 *          will operate.
 *
 *  The function will set a dependency on it power domain, i.e. power up the
 *  module and enable the clock. The IOs are allocated. Neither the RX nor TX
 *  will be enabled, and none of the interrupts are enabled.
 *
 *  @pre    UART controller has been initialized
 *          Calling context: Task
 *
 *  @param  handle        A UART_Handle
 *
 *  @param  params        Pointer to a parameter block, if NULL it will use
 *                        default values
 *
 *  @return A UART_Handle on success or a NULL on an error or if it has been
 *          already opened
 *
 *  @sa     UARTBLXXX_close()
 */
UART_Handle UARTBLXXX_open(UART_Handle handle, UART_Params *params)
{
    UARTBLXXX_Object               *object;
    UARTBLXXX_HWAttrsV2 const     *hwAttrs;

    object = handle->object;
    hwAttrs = handle->hwAttrs;

    /* Check if the UART is open already with the base addr. */
    if (object->opened == true) {
        MSG("UART:(%p) already in use.", handle);
        return (NULL);
    }

    object->opened = true;
    
