bouffalolab/bl_iot_sdk/components/platform/soc/bl702/bl702_std/BSP_Driver/LHalDriver/Src/lhal_bl702_uart.c
    if(hwAttrs->deviceIndex > UARTBLXXX_MAX_UART_NUM){
        return (NULL);
    }

    /* Initialize the UART object */
    object->readMode       = params->readMode;
    object->writeMode      = params->writeMode;
    object->readTimeout    = params->readTimeout;
    object->writeTimeout   = params->writeTimeout;
    object->readCallback   = params->readCallback;
    object->writeCallback  = params->writeCallback;
    object->readReturnMode = params->readReturnMode;
    object->readDataMode   = params->readDataMode;
    object->writeDataMode  = params->writeDataMode;
    object->baudRate       = params->baudRate;
    object->dataLength     = params->dataLength;
    object->stopBits       = params->stopBits;
    object->parityType     = params->parityType;

    /* Set UART transaction variables to defaults. */
    object->writeBuf = NULL;
    object->readBuf = NULL;
    object->writeCount = 0;
    object->readCount = 0;
    object->writeSize = 0;
    object->readSize = 0;
    object->writeCR = false;

    object->ringBuffer = &uart_rx_ringBuffer;
    
    /* Configure IOs, make sure it was successful */
    if(UARTBLXXX_initIO(handle) != SUCCESS) {
        /* Trying to use UART driver when some other driver or application
        *  has already allocated these pins, error!
        */
        //DebugP_log0("Could not allocate pins, already in use.");
        /* Disable UART */
        UART_Disable(hwAttrs->deviceIndex,UART_TXRX);
        uart_device_open_status[hwAttrs->deviceIndex] = RESET;
        object->opened = false;
        return (NULL);
    }

    UARTBLXXX_initHw(handle);
    
    /* Create circular buffer object to be used for read buffering */
    //RingBuf_construct(&object->ringBuffer, hwAttrs->ringBufPtr, hwAttrs->ringBufSize);

    /*tell uart lhal device open status*/
    uart_device_open_status[hwAttrs->deviceIndex]= SET;

    /* steup up ringbuffer */
    /*Ring_Buffer_Type* rbType,uint8_t* buffer,uint16_t size,ringBuffer_Lock_Callback* lockCb,ringBuffer_Lock_Callback* unlockCb*/
    Ring_Buffer_Init(object->ringBuffer,hwAttrs->ringBufPtr,hwAttrs->ringBufSize,(ringBuffer_Lock_Callback *)hwAttrs->ringBufferLockFnx,(ringBuffer_Lock_Callback *)hwAttrs->ringBufferUnlockFnx);

    return (handle);
}

/*!
 *  @brief  Function to close a given BLXXX UART peripheral specified by the
 *          UART handle.
 *
 *  Will disable the UART, disable all UART interrupts and release the
 *  dependency on the corresponding power domain.
 *
 *  @pre    UARTBLXXX_open() had to be called first.
 *          Calling context: Task
 *
 *  @param  handle  A UART_Handle returned from UART_open()
 *
 *  @sa     UARTBLXXX_open
 */
void UARTBLXXX_close(UART_Handle handle)
{
    UARTBLXXX_Object            *object;
    UARTBLXXX_HWAttrsV2 const   *hwAttrs;

    /* Get the pointer to the object and hwAttrs */
    object = handle->object;
    hwAttrs = handle->hwAttrs;

    /* Deallocate pins */
    //PIN_close(object->hPin); //TODO

    /* Disable all UART module interrupts. */
    UART_IntMask(hwAttrs->deviceIndex, UART_INT_ALL,MASK);  

    /* Clear all UART interrupts */
    UART_IntClear(hwAttrs->deviceIndex, UART_INT_ALL);

    /* Mark the module as available */
    object->opened = false;

    /* Cancel any possible ongoing reads/writes */
    UARTBLXXX_writeCancel(handle);
    UARTBLXXX_readCancel(handle);

    uart_device_open_status[hwAttrs->deviceIndex] = RESET;

    /* Disable UART module */
    UART_Disable(hwAttrs->deviceIndex,UART_TXRX);
}

/*!
 *  @brief  Function for setting control parameters of the UART
 *          after it has been opened.
 *
 *  @pre    UARTBLXXX_open() has to be called first.
 *          Calling context: Hwi, Swi, Task
 *
 *  @param  handle A UART handle returned from UARTBLXXX_open()
 *
 *  @param  cmd  The command to execute, supported commands are:
 *          | Command                               | Description             |
 *          |-------------------------------------- |-------------------------|
 *          | ::UARTBLXXX_CMD_RX_FIFO_FLUSH | Flush rx fifo buffer  |
 *
 *  @param  *arg  Pointer to command arguments, currently not in use, set to NULL.
 *
 *  @return ::UART_STATUS_SUCCESS if success, or error code if error.
 */
int_fast16_t UARTBLXXX_control(UART_Handle handle, uint_fast16_t cmd,void *arg){
    UARTBLXXX_Object            *object;
    UARTBLXXX_HWAttrsV2 const   *hwAttrs;
    int ret;

    /* Get the pointer to the object and hwAttrs */
    object = handle->object;
    hwAttrs = handle->hwAttrs;

    /* Initialize return value*/
    ret = UART_STATUS_UNDEFINEDCMD;

    switch(cmd)
    {
        case UARTBLXXX_CMD_RX_FIFO_FLUSH:
            /* Flush RX FIFO */
            hwAttrs = handle->hwAttrs;

            /* Read RX FIFO until empty */
            UART_RxFifoClear(hwAttrs->deviceIndex);

            /* Reset RingBuf */
            //Todo

            /* Set size = 0 to prevent reading and restore interrupts. */
            object->readSize = 0;

            ret = UART_STATUS_SUCCESS;
        break;

        case UARTBLXXX_CMD_TX_FREE_INT_ENABLE: UART_IntMask(hwAttrs->deviceIndex,UART_INT_TX_FIFO_REQ,UNMASK);break;
        case UARTBLXXX_CMD_TX_FREE_INT_DISABLE: UART_IntMask(hwAttrs->deviceIndex,UART_INT_TX_FIFO_REQ,MASK);break;
        case UARTBLXXX_CMD_RX_INT_ENABLE:UART_IntMask(hwAttrs->deviceIndex,UART_INT_RX_FIFO_REQ,UNMASK);UART_IntMask(hwAttrs->deviceIndex,UART_INT_RTO,UNMASK);break;
        case UARTBLXXX_CMD_RX_INT_DISABLE:UART_IntMask(hwAttrs->deviceIndex,UART_INT_RX_FIFO_REQ,MASK);UART_IntMask(hwAttrs->deviceIndex,UART_INT_RTO,MASK);break;
        default:
            /* This command is not defined */
            ret = UART_STATUS_UNDEFINEDCMD;
        break;
    }

    /* Return */
    return (ret);
}
/**
 * @brief uart write function 
 *        when write mode set as BLCOK WRITE MODE,write function will work as Blcok mode
 *        in Block Mode , uart will block send data until data all sent done or block time out
 *         
 * 
 * @param handle 
 * @param buffer 
 * @param size 
 * @return int_fast32_t 
 */
int_fast32_t UARTBLXXX_write(UART_Handle handle, const void *buffer,size_t size){
    UARTBLXXX_Object               *object;
    UARTBLXXX_HWAttrsV2 const     *hwAttrs;

    /* Get the pointer to the object */
    object = handle->object;
    hwAttrs = handle->hwAttrs;   

    uint32_t uartAddr[2] = {UART0_BASE,UART1_BASE};
    uint32_t timeoutCnt = object->writeTimeout;

