bouffalolab/bl_iot_sdk/components/platform/soc/bl702/bl702_std/BSP_Driver/LHalDriver/Src/lhal_bl702_uart.c
    if(object->writeMode == UART_MODE_BLOCKING){

    object->writeBuf = buffer;
    object->writeCount = 0;
    /* Send data */
    while(size){

        if(UART_GetTxFifoCount(hwAttrs->deviceIndex)>0){
            BL_WR_BYTE(uartAddr[hwAttrs->deviceIndex]+UART_FIFO_WDATA_OFFSET,*((uint8_t *)object->writeBuf + object->writeCount));
            object->writeCount++;
            timeoutCnt = object->writeTimeout;
            size --;
        }else{
            timeoutCnt--;
            if(timeoutCnt == 0){
                return TIMEOUT;
            }
        }

    }

    timeoutCnt = object->writeTimeout;

    while(UART_GetTxBusBusyStatus(hwAttrs->deviceIndex) == SET){}

    }else if(object->writeMode == UART_MODE_CALLBACK){
        /* Disable UART function. */
        UART_Disable(hwAttrs->deviceIndex,UART_TXRX);
        UART_Int_Callback_Install(hwAttrs->deviceIndex,UART_INT_TX_FIFO_REQ,tx_func_list[hwAttrs->deviceIndex]);

        uart_handle_temp[hwAttrs->deviceIndex] = handle;

        object->writeBuf = buffer;
        object->writeSize = size;
        object->writeCount =0;

        /*unmask interrupt */
        UART_IntMask(hwAttrs->deviceIndex,UART_INT_TX_FIFO_REQ,UNMASK);

        /* Disable UART function. */
        UART_Enable(hwAttrs->deviceIndex,UART_TXRX);
    }else{

    }

    return SUCCESS;
}
/**
 * @brief Cancel write operation 
 * 
 * @param handle 
 * 
 * Not Supported
 */
void UARTBLXXX_writeCancel(UART_Handle handle){
    /* Not supported */
}
/**
 * @brief uart read data
 *        in block mode uart will read size data or read time out
 *        For examples
 *              while( UART_read(uart_device,read_buf,6) != SUCCESS);
 *        contorller will rec fixed len data or will timeout
 * @param handle 
 * @param buffer 
 * @param size 
 * @return int_fast32_t 
 */
int_fast32_t UARTBLXXX_read(UART_Handle handle, void *buffer, size_t size){
    UARTBLXXX_Object               *object;
    UARTBLXXX_HWAttrsV2 const     *hwAttrs;

    /* Get the pointer to the object */
    object = handle->object;
    hwAttrs = handle->hwAttrs;   

    uint32_t uartAddr[2] = {UART0_BASE,UART1_BASE};
    uint32_t timeoutCnt = object->readTimeout;
    size_t recLen=0;

    if(object->readMode == UART_MODE_BLOCKING){

        while(recLen<=size){
            if(UART_GetRxFifoCount(hwAttrs->deviceIndex)>0){
                *((uint8_t *)buffer+recLen) = BL_RD_BYTE(uartAddr[hwAttrs->deviceIndex]+UART_FIFO_RDATA_OFFSET);
                recLen++;
                timeoutCnt = object->readTimeout;
            }else{
                timeoutCnt --;
                if(timeoutCnt == 0){
                    return TIMEOUT;
                }
            }
        }

    }else if(object->readMode == UART_MODE_CALLBACK){

    }else{
        /*
         * DMA MODE not support write
         * User can use DMA Module to start uart transfer
         */

    }

    return SUCCESS;
}

/**
 * @brief dump data stored at rx fifo
 * 
 * @param handle 
 * @return uint_fast16_t 
 */
uint_fast16_t UARTBLXXX_rxFifoDump(UART_Handle handle,uint8_t * buf){

    uint32_t  dataLenInRxFifo;
    UARTBLXXX_HWAttrsV2 const     *hwAttrs;
    
    hwAttrs = handle->hwAttrs;

    dataLenInRxFifo = UART_ReceiveData(hwAttrs->deviceIndex,buf,16);
    
    return dataLenInRxFifo;
}

/**
 * @brief Cancel read operation 
 * 
 * @param handle 
 * 
 * Not Supported
 */
void UARTBLXXX_readCancel(UART_Handle handle){
    /* Not supported */
}

/*
 *  ======== UARTBLXXX_initIO ========
 *  This functions initializes the UART IOs.
 *
 *  @pre    Function assumes that the UART handle is pointing to a hardware
 *          module which has already been opened.
 */
static bool UARTBLXXX_initIO(UART_Handle handle){
    /* Locals */
    UARTBLXXX_HWAttrsV2 const     *hwAttrs;
    uint8_t uart_gpioPins[2];   
    uint8_t port_sig[4];

    //TODO:use pin_open to implement it

    /* Get the pointer to the object and hwAttrs */
    hwAttrs = handle->hwAttrs;

    uart_gpioPins[0] = hwAttrs->txPin;
    uart_gpioPins[1] = hwAttrs->rxPin;


    //TODO io redefine error check

    /*
     * Initial UART IO 
     */
    GLB_GPIO_Func_Init(GPIO_FUN_UART,uart_gpioPins,sizeof(uart_gpioPins)/sizeof(uart_gpioPins[0]));

    port_sig[0] = hwAttrs->txPin % 8;
    port_sig[1] = hwAttrs->rxPin % 8;

    if(port_sig[0] == port_sig[1]){
        return ERROR;
        /* single can not be same */
    }

    if(hwAttrs->deviceIndex == 0){
        GLB_UART_Fun_Sel(port_sig[0],GLB_UART_SIG_FUN_UART0_TXD);
        GLB_UART_Fun_Sel(port_sig[1],GLB_UART_SIG_FUN_UART0_RXD);
    }else{
        GLB_UART_Fun_Sel(port_sig[0],GLB_UART_SIG_FUN_UART1_TXD);
        GLB_UART_Fun_Sel(port_sig[1],GLB_UART_SIG_FUN_UART1_RXD);        
    }

    return SUCCESS;

}

/*
 *  ======== UARTBLXXX_initHW ========
 *  This functions initializes the UART hardware module.
 *
 *  @pre    Function assumes that the UART handle is pointing to a hardware
 *          module which has already been opened.
 */
static void UARTBLXXX_initHw(UART_Handle handle) {
    UARTBLXXX_Object *object;
    UARTBLXXX_HWAttrsV2 const *hwAttrs;
    UART_FifoCfg_Type UART_FifoCfg={
        16,                   /* TX FIFO threshold */
        16,                   /* RX FIFO threshold */
        DISABLE,              /* Disable tx dma req/ack interface */
        DISABLE               /* Disable rx dma req/ack interface */
    };
    UART_CFG_Type UART_CFG={
        96*1000*1000,                                        /* UART clock */
        2000000,                                             /* UART Baudrate */
        UART_DATABITS_8,                                     /* UART data bits length */
        UART_STOPBITS_1,                                     /* UART data stop bits length */
        UART_PARITY_NONE,                                    /* UART no parity */
        DISABLE,                                             /* Disable auto flow control */
        DISABLE,                                             /* Disable rx input de-glitch function */
        DISABLE,                                             /* Disable RTS output SW control mode */
        DISABLE,                                             /* Disable tx output SW control mode */
        DISABLE,                                             /* Disable tx lin mode */
        DISABLE,                                             /* Disable rx lin mode */
        0,                                                   /* Tx break bit count for lin mode */
        UART_LSB_FIRST                                       /* UART each data byte is send out LSB-first */
    };

