bouffalolab/bl_iot_sdk/components/platform/soc/bl702/bl702_std/BSP_Driver/LHalDriver/Src/lhal_bl702_uart.c
    /* Get the pointer to the object and hwAttrs */
    object = handle->object;
    hwAttrs = handle->hwAttrs;

    if(hwAttrs->deviceIndex == 0){
        GLB_AHB_Slave1_Clock_Gate(DISABLE,BL_AHB_SLAVE1_UART0);
    }else{
        GLB_AHB_Slave1_Clock_Gate(DISABLE,BL_AHB_SLAVE1_UART1);        
    }

    /* Configure frame format and baudrate */
    GLB_Set_UART_CLK(ENABLE ,HBN_UART_CLK_96M,0);

    GLB_AHB_Slave1_Reset(BL_AHB_SLAVE1_UART0+hwAttrs->deviceIndex);

    /* Disable all UART module interrupts. */
    UART_IntMask(hwAttrs->deviceIndex, UART_INT_ALL,MASK);  

    /* Disable UART function. */
    UART_Disable(hwAttrs->deviceIndex,UART_TXRX);

    UART_CFG.baudRate = object->baudRate;
    UART_CFG.uartClk = 96*1000*1000;
    UART_CFG.dataBits = object->dataLength;
    UART_CFG.stopBits = object->stopBits;
    UART_CFG.parity = object->parityType;

    UART_Init(hwAttrs->deviceIndex,&UART_CFG);

    /* Clear all UART interrupts */
    UART_IntClear(hwAttrs->deviceIndex, UART_INT_ALL);

    /* Set TX interrupt FIFO level and RX interrupt FIFO level */
    UART_FifoCfg.txFifoDmaThreshold =  hwAttrs->dmaTxIntFifoThr;
    UART_FifoCfg.rxFifoDmaThreshold =  hwAttrs->dmaRxIntFifoThr;

    if(object->readMode == UART_MODE_DMA){
        UART_FifoCfg.rxFifoDmaEnable = ENABLE;
    }

    if(object->writeMode == UART_MODE_DMA){
        UART_FifoCfg.txFifoDmaEnable = ENABLE;
    }

    UART_FifoConfig(hwAttrs->deviceIndex, &UART_FifoCfg);


    /*unmask interrupt */
    UART_IntMask(hwAttrs->deviceIndex,UART_INT_PCE,UNMASK); // Parity error interrupt
    UART_IntMask(hwAttrs->deviceIndex,UART_INT_TX_FER,UNMASK);// tx fifo overflow
    UART_IntMask(hwAttrs->deviceIndex,UART_INT_RX_FER,UNMASK);// rx fifo overflow

    UART_Int_Callback_Install(hwAttrs->deviceIndex,UART_INT_PCE,UARTBLXXX_ERROR_Cbf);
    UART_Int_Callback_Install(hwAttrs->deviceIndex,UART_INT_TX_FER,UARTBLXXX_ERROR_Cbf);
    UART_Int_Callback_Install(hwAttrs->deviceIndex,UART_INT_RX_FER,UARTBLXXX_ERROR_Cbf);


    /* Set rx time-out value used for data tail*/
    UART_SetRxTimeoutValue(hwAttrs->deviceIndex,UART_DEFAULT_RECV_TIMEOUT);

    /*unmask interrupt */
    UART_IntMask(hwAttrs->deviceIndex,UART_INT_RX_FIFO_REQ,MASK);
    UART_IntMask(hwAttrs->deviceIndex,UART_INT_RTO,MASK);

    /*install interrupt callback */
    UART_Int_Callback_Install(hwAttrs->deviceIndex,UART_INT_RX_FIFO_REQ,rx_func_list[hwAttrs->deviceIndex % UARTBLXXX_MAX_UART_NUM]);
    UART_Int_Callback_Install(hwAttrs->deviceIndex,UART_INT_RTO,rx_func_list[hwAttrs->deviceIndex % UARTBLXXX_MAX_UART_NUM]);

    uart_handle_temp[hwAttrs->deviceIndex] = handle;

    /* Enable UART interrupt*/
    NVIC_EnableIRQ(uartIrqn_list[hwAttrs->deviceIndex]);

    /* Enable tx free run mode */
    UART_TxFreeRun(hwAttrs->deviceIndex,ENABLE);
    UART_Enable(hwAttrs->deviceIndex,UART_TXRX);
}

static void UARTBLXXX_UART0_RX_Cbf(void){
    UARTBLXXX_Object               *object;
    UARTBLXXX_HWAttrsV2 const     *hwAttrs;
    uint32_t rx_len=0;
    uint8_t rx_buf[UARTBLXXX_FIFO_SIZE];
    uint32_t maxLen = 0xFFFFFFFE;

    object = uart_handle_temp[0]->object;
    hwAttrs = uart_handle_temp[0]->hwAttrs;  
     
    rx_len = UART_ReceiveData(hwAttrs->deviceIndex,rx_buf,maxLen);

    if(object->readCallback != NULL){
        object->readCallback(uart_handle_temp[0],rx_buf,rx_len);
    }
}

static void UARTBLXXX_UART1_RX_Cbf(void){
    UARTBLXXX_Object               *object;
    UARTBLXXX_HWAttrsV2 const     *hwAttrs;
    uint32_t rx_len=0;
    uint8_t rx_buf[UARTBLXXX_FIFO_SIZE];
    uint32_t maxLen = 0xFFFFFFFE;

    object = uart_handle_temp[1]->object;
    hwAttrs = uart_handle_temp[1]->hwAttrs;  
     
    rx_len = UART_ReceiveData(hwAttrs->deviceIndex,rx_buf,maxLen);

    if(object->readCallback != NULL){
        object->readCallback(uart_handle_temp[1],rx_buf,rx_len);
    }
}

static void UARTBLXXX_UART0_TX_Cbf(void){
    UARTBLXXX_Object               *object;
    UARTBLXXX_HWAttrsV2 const     *hwAttrs;

    uint32_t uartAddr[2] = {UART0_BASE,UART1_BASE};

    object = uart_handle_temp[0]->object;
    hwAttrs = uart_handle_temp[0]->hwAttrs;  
    
    while(UART_GetTxFifoCount(hwAttrs->deviceIndex)>0 && object->writeCount < object->writeSize){
        BL_WR_BYTE(uartAddr[hwAttrs->deviceIndex]+UART_FIFO_WDATA_OFFSET,*((uint8_t *)object->writeBuf + object->writeCount));
        object->writeCount++;
    }

    if(object->writeCount == object->writeSize){
        if(object->writeCallback != NULL){
            object->writeCallback(uart_handle_temp[0],(uint8_t *)object->writeBuf,object->writeSize);
        }
        UART_IntMask(hwAttrs->deviceIndex,UART_INT_TX_FIFO_REQ,MASK);
    }
}

static void UARTBLXXX_UART1_TX_Cbf(void){
    UARTBLXXX_Object               *object;
    UARTBLXXX_HWAttrsV2 const     *hwAttrs;

    uint32_t uartAddr[2] = {UART0_BASE,UART1_BASE};

    object = uart_handle_temp[1]->object;
    hwAttrs = uart_handle_temp[1]->hwAttrs;  
    
    while(UART_GetTxFifoCount(hwAttrs->deviceIndex)>0 && object->writeCount < object->writeSize){
        BL_WR_BYTE(uartAddr[hwAttrs->deviceIndex]+UART_FIFO_WDATA_OFFSET,*((uint8_t *)object->writeBuf + object->writeCount));
        object->writeCount++;
    }

    if(object->writeCount == object->writeSize){
        if(object->writeCallback != NULL){
            object->writeCallback(uart_handle_temp[1],(uint8_t *)object->writeBuf,object->writeSize);
        }
        UART_IntMask(hwAttrs->deviceIndex,UART_INT_TX_FIFO_REQ,MASK);
    }
}


static void UARTBLXXX_ERROR_Cbf(void){
    UARTBLXXX_HWAttrsV2 const     *hwAttrs;

    uint32_t tmpVal = 0;
    uint32_t uartAddr[2] = {UART0_BASE,UART1_BASE};
    uint32_t UARTx = 0;
    uint32_t maskVal = 0;
    uint8_t i=0;

    for(i=0;i<UARTBLXXX_MAX_UART_NUM;i++){

        if(uart_device_open_status[i] == SET){
            UARTx = uartAddr[i];
            tmpVal = BL_RD_REG(UARTx,UART_INT_STS);
            maskVal = BL_RD_REG(UARTx,UART_INT_MASK);

            hwAttrs = uart_handle_temp[i]->hwAttrs;  

            /* Rx parity check error interrupt */
            if(BL_IS_REG_BIT_SET(tmpVal,UART_URX_PCE_INT) && !BL_IS_REG_BIT_SET(maskVal,UART_CR_URX_PCE_MASK)){
                BL_WR_REG(UARTx,UART_INT_CLEAR,0x20);
                if(hwAttrs->errorFxn != NULL){
                    hwAttrs->errorFxn(uart_handle_temp[i],UART_INT_PCE);
                }
            }
            
