bouffalolab/bl_iot_sdk/components/platform/soc/bl702/bl702_std/BSP_Driver/LHalDriver/Src/lhal_bl702_uart.c
            /* Tx fifo overflow/underflow error interrupt */
            if(BL_IS_REG_BIT_SET(tmpVal,UART_UTX_FER_INT) && !BL_IS_REG_BIT_SET(maskVal,UART_CR_UTX_FER_MASK)){
                if(hwAttrs->errorFxn != NULL){
                    hwAttrs->errorFxn(uart_handle_temp[i],UART_INT_TX_FER);
                }
            }
            
            /* Rx fifo overflow/underflow error interrupt */
            if(BL_IS_REG_BIT_SET(tmpVal,UART_URX_FER_INT) && !BL_IS_REG_BIT_SET(maskVal,UART_CR_URX_FER_MASK)){
                if(hwAttrs->errorFxn != NULL){
                    hwAttrs->errorFxn(uart_handle_temp[i],UART_INT_RX_FER);
                }
            }
        }
    }
}

uint_fast32_t  UARTBLXXX_getDMAAddr(UART_Handle handle){
    UARTBLXXX_HWAttrsV2 const *hwAttrs;
    uint32_t dma_addr;

    hwAttrs = handle->hwAttrs;

    dma_addr =  uart_dma_addr_list[hwAttrs->deviceIndex] + 0x100 * hwAttrs->deviceIndex;
    
    return dma_addr; 
}


uint_fast8_t UARTBLXXX_getRxReq(UART_Handle handle){
    UARTBLXXX_HWAttrsV2 const     *hwAttrs;

    hwAttrs = handle->hwAttrs;

    if(hwAttrs->deviceIndex == 0){
        return DMA_REQ_UART0_RX;
    }else{
        return DMA_REQ_UART1_RX;
    }  

}
uint_fast8_t UARTBLXXX_getTxReq(UART_Handle handle){
    UARTBLXXX_HWAttrsV2 const     *hwAttrs;

    hwAttrs = handle->hwAttrs;

    if(hwAttrs->deviceIndex == 0){
        return DMA_REQ_UART0_TX;
    }else{
        return DMA_REQ_UART1_TX;
    }  
}

